Map subjectClasses = {
  "firstterm": {
    "ComputerScience": {
      "first": ["", "", "", "", ""],
      "second": ["", "", "", "", ""],
      "third": ["", "", "", "", ""],
      "fourth": ["", "", "", "", ""],
    },
    "Informationsystems": {
      "first": ["", "", "", "", ""],
      "second": [
        {"subject": "ادارة الانتاج والعمليات", "code": "5685"},
        {"subject": "البرمجة الهيكلة المتقدمة", "code": "5686"},
        {"subject": "محاسبة شركات", "code": "5685"},
        {"subject": "قواعد بيانات 1", "code": "5685"},
        {"subject": "دراسات اقتصادية بالغة الانجليزية", "code": "5685"}
      ],
      "third": ["", "", "", "", ""],
      "fourth": ["", "", "", "", ""],
    },
    "accounting": {
      "first": ["", "", "", "", ""],
      "second": ["", "", "", "", ""],
      "third": ["", "", "", "", ""],
      "fourth": [
        "تطبيقات محاسبة باستخدام الحاسب",
        "محاسبة دولية",
        "التمويل والادارة المالية",
        "المحاسبة الضريبية 2",
        "نظم معلومات محاسبية",
        "نظم محاسبة تكاليف",
      ],
    }
  },
  // "Secondterm": {
  //   "Computer Science": {
  //     "first": ["", "", "", "", ""],
  //     "second": ["", "", "", "", ""],
  //     "third": ["", "", "", "", ""],
  //     "fourth": ["", "", "", "", ""],
  //   },
  //   "Informationsystems": {
  //     "first": ["", "", "", "", ""],
  //     "second": ["", "", "", "", ""],
  //     "third": ["", "", "", "", ""],
  //     "fourth": ["", "", "", "", ""],
  //   },
  //   "accounting": {
  //     "first": ["", "", "", "", ""],
  //     "second": ["", "", "", "", ""],
  //     "third": ["", "", "", "", ""],
  //     "fourth": ["", "", "", "", ""],
  //   }
  // }
};
